Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྟོན་པར་མཛད་པ། བསམ་པ་ལེགས་པར་མཛད་པ་ལ་
en: to the one who is a teacher of the six perfections; and to the one whose thoughts are good.

source: གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ཁྱོད་ཀྱི་མཚན་རྗེས་སུ་དྲན་པའི་སེམས་ཅན་དེ་དག་ནི་བདེ་བ་དང་ལྡན་པ་ལགས་སོ།
en: “ ‘The beings who remember your name, Bodhisattva Mahāsattva Avalokiteśvara, will have happiness.

source: ཐིག་ནག་པོ་ཅན་དང་། འོ་དོད་འབོད་པ་དང་། སེམས་ཅན་དམྱལ་བར་སྐྱེས་པ་དང་། ཡི་དགས་ཀྱི་གྲོང་ཁྱེར་དུ་སྐྱེས་པ་གང་དག་ཁྱོད་ཀྱི་མཚན་རྗེས་སུ་དྲན་པ་དེ་དག་ནི་ངན་སོང་གི་སྡུག་བསྔལ་ཆེན་པོ་ལས་ཐར་བ་ལགས་སོ། །
en: When those who have been born in Kālasūtra, Raurava, Avīci, and in the city of the pretas remember your name, they will be freed from the great suffering of the lower existences.

source: གང་ཁྱོད་ཀྱི་མཚན་རྗེས་སུ་དྲན་པའི་སེམས་ཅན་དེ་དག་ནི་བསམ་པ་ལེགས་པ་དང་ལྡན་པ་ལགས་ཏེ། །
en: The beings who remember your name will have good thoughts.

source: དེ་དག་ནི་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་མཆིས་ནས་དེ་བཞིན་གཤེགས་པ་སྣང་བ་མཐའ་ཡས་ལས་ཆོས་ཉན་པར་འགྱུར་རོ། །
en: They will go to the realm of Sukhāvatī, and listen to the Dharma from Tathāgata Amitābha.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་ལྷ་མ་ཡིན་གྱི་དབང་པོ་གཏོར་མ་ལ་ལུང་བསྟན་པ། །
en: “Then Bodhisattva Mahāsattva Avalokiteśvara made the following prophecy to Bali, the lord of the asuras:

source: ཁྱོད་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས། རིག་པ་དང་རྐང་པར་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལྷ་མ་ཡིན་གྱི་དབང་པོའི་དཔལ་ཞེས་བྱ་བར་འགྱུར་ཏེ། །
en: ‘You, lord of the asuras, will become the Tathāgata, the arhat, the samyaksaṃbuddha, perfect in wisdom and conduct, the sugata, the knower of the world, the unsurpassable guide who tamed beings, the teacher of devas and humans, the buddha, the Bhagavat Śrī.

source: ལྷ་མ་ཡིན་ཐམས་ཅད་འདུལ་བར་འགྱུར་རོ།
en: You will guide all the asuras.

source: ཁྱོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ན་འདོད་ཆགས་ཀྱི་སྒྲ་མེད།
en: In your buddha realm there will not be the word desire

source: ཞེ་སྡང་གི་སྒྲ་མེད།
en: there will not be the word anger

source: གཏི་མུག་གི་སྒྲ་མེད་པར་འགྱུར་རོ། །
en: there will not be the word ignorance

source: ཡི་གེ་དྲུག་པའི་རིག་པ་ཆེན་པོ་འཐོབ་པ་ཐོབ་པར་འགྱུར་རོ། །
en: and you will come into possession of the six-syllable mahāvidyā.’

source: དེས་དེ་ལ་ཆོས་ཀྱི་སྦྱིན་པ། མུ་ཏིག་གི་སེ་མོ་དོ་འདོམ་སྟོང་པ་རིན་བརྒྱ་སྟོང་རི་བ་དང་། ཅོད་པན་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་ཕུལ་ལོ། །
en: “As a gift with which to request the Dharma, Bali presented Avalokiteśvara with strings of pearls worth a hundred thousand silver coins and diadems adorned with various jewels.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ཆོས་འཆད་པར་རྩོམ་སྟེ།
en: “Then Bodhisattva Mahāsattva Avalokiteśvara began to teach the Dharma.

source: རྒྱལ་པོ་ཆེན་པོ་ཉོན་ཅིག །
en: “ ‘Listen, great king.

source: མི་མི་རྟག་པའི་ནང་ན་གང་རྟག་ཏུ་ཡོངས་སུ་ལེན་པར་སེམས་པ་དང་། ལོངས་སྤྱོད་ཆེན་པོའི་རྗེས་སུ་སེམས་པ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པའི་མི་དང་། གང་ཡང་ནོར་དང་། འབྲུ་དང་། མཛོད་དང་། བང་བ་རིན་པོ་ཆེ་དག་དང་། གང་བུ་དང་། བུ་མོ་དང་། ཆུང་མ་དང་། ཕ་དང་མ་ལ་སེམས་པའི་སེམས་ཅན་དེ་དག་ནི་
en: Human beings are continually thinking about transitory things, about acquisitions, about great pleasures, about male and female slaves, servants, and hired workers, about costly clothes, beds, and seats, about valuable treasures, riches, stores of grain, and storerooms, about sons and daughters, and about wives and parents.

source: མི་ཤེས་པ་ཡིན་ཏེ།
en: They are ignorant.

source: གང་དངོས་པོ་དེ་དག་ལ་ཆགས་པའི་སེམས་ཅན་དེ་དག་ནི་རྨི་ལམ་ལྟ་བུར་སྣང་སྟེ། །
en: Those things that they are attached to appear as dreams do.

source: འཆི་བའི་དུས་ཀྱི་ཚེ་ཡང་སྐྱབས་བྱེད་པ་སུ་ཡང་མེད་པར་འགྱུར་རོ། །
en: “ ‘At the time of death, there will be no one to protect them.

source: གང་གི་ཚེ་ན་སྲོག་དང་བྲལ་བ་དེའི་ཚེ་འཛམ་བུའི་གླིང་ལ་ལོག་པར་མཐོང་བར་འགྱུར་རོ། །
en: When they are separated from their lives they will look back at Jambudvīpa.

source: ཆུ་བོ་ཆེན་པོ་ལ་ཡང་ཁྲག་དང་རྣག་གིས་གང་བར་མཐོང་བར་འགྱུར་རོ། །
en: They will see the great river filled with pus and blood.

source: གང་ཤིང་ཆེན་པོ་དེ་དག་ཀྱང་འབར་བ། རབ་ཏུ་འབར་བ། ཡང་དག་པར་ཤིན་ཏུ་འབར་བར་མཐོང་བར་འགྱུར་རོ། །
en: They will see the great trees that blaze with fire, blaze strongly, and blaze fiercely.

source: མཐོང་ནས་ཀྱང་སྐྲག་པར་འགྱུར་ཞིང་
en: When they see them they will be terrified.

source: ཞགས་པས་བཅིངས་ཏེ་ཁྲིད་པར་འགྱུར་རོ། །
en: bind them with nooses and drag them away.

source: སྤུ་གྲིའི་སོའི་ལམ་ཆེན་པོར་རྐང་པ་ཡང་འཆད་པར་འགྱུར་རོ། །རྐང་པ་བཏེག་པ་དང་རྐང་པ་གཞན་འབྱུང་བར་འགྱུར་རོ།
en: When their feet are cut through on the great road of razors, as they lift that foot another foot will replace it.

source: བྱ་རོག་དང་། བྱ་རྒོད་དང་། བྱ་ཀུ་ར་ར་དང་། ཁྱི་དུ་མ་དག་གིས་ཀྱང་ཟོས་ཤིང་
en: Numerous ravens, vultures, eagles, and dogs will devour them.

source: སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་གྱི་ཚོར་བ་ཆེན་པོ་མྱོང་བར་འགྱུར་རོ། །
en: They will experience the sensation of great suffering in the hells.

source: དེ་ནས་སྤུ་གྲིའི་སོའི་ལམ་ཆེན་པོ་ལས་བབས་ནས་རྐང་པ་རེ་རེ་ལ་ཡང་ཚེར་མ་སོར་བཅུ་དྲུག་ཙམ་ཡོད་པ་ལྔ་བརྒྱ་ལྔ་བརྒྱ་ཟུག་པར་འགྱུར་ཏེ།
en: When they step off the great road of razors, five hundred thorns, each with sixteen spikes, will pierce each foot.

source: བདག་ཅག་གིས་སྡིག་པའི་ལས་ཅི་ཞིག་བྱས་ཞེས་འཁོང་བར་འགྱུར་རོ། །
en: They will cry out, “What have I, who delighted in bad actions, done?”

source: དེ་ནས་གཤིན་རྗེའི་མི་དེ་དག་འདི་སྐད་ཅེས་ཟེར་ཏེ།
en: “ ‘Yama’s servants will reply,

source: གྲོགས་པོ་ཁྱེད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་བསོད་སྙོམས་མ་ཕུལ་ལོ། །
en: “Friend, you did not offer alms to the Tathāgata.

source: ཁྱེད་ཀྱིས་གཎ་ཌི་རྡུང་བ་ཡང་མ་ཐོས་སོ། །
en: You did not hear the gaṇḍī being beaten.

source: ཁྱོད་ཀྱིས་ས་ཕྱོགས་གང་དུ་ཡང་མཆོད་རྟེན་གྱི་གཟུགས་ལ་མ་བསྐོར་ཏོ།
en: You did not circumambulate a stūpa anywhere.”

source: དེ་དག་གིས་སྨྲས་པ། །
en: “ ‘To that they will reply,

source: བདག་ཅག་ནི་མ་དད་པ་སྡིག་པ་ཅན་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་གྱིས་སྤངས་པར་གྱུར་པའོ།
en: “We were without faith, delighted in bad actions, rejected the Buddha, Dharma, and Saṅgha,

source: ལས་དེའི་འབྲས་བུ་འདི་མྱོང་བར་གྱིས་ཤིག་
en: and are experiencing the result of those actions.”

source: གཤིན་རྗེའི་སྐྱོང་བས། གཤིན་རྗེའི་རྒྱལ་པོའི་དྲུང་དུ་ཁྲིད་དོ། །
en: “ ‘Yama’s guardians will then take them to King Yama,

source: ཁྲིད་ནས་ཕུལ་ལོ། །
en: bring them before him, and present them to him.

source: དེ་ནས་གཤིན་རྗེའི་རྒྱལ་པོས་སྨྲས་པ།
en: “ ‘King Yama will say

source: ཁྱེད་དེང་ལ་ལས་ཀྱིས་འདི་སྟོན་ཅིག །
en: “Show them today your place of work!”

source: དེ་ནས་གཤིན་རྗེ་སྐྱོང་བའི་སྐྱེས་བུ་དེ་དག་གིས་དེ་རྣམས་ཁྲིད་ནས་ཐིག་ནག་པོ་ཅན་གྱི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་བཅུག་གོ། །
en: “ ‘So Yama’s guardians will bring them to the great Kālasūtra hell and put them into it.

source: བཅུག་ནས་ལུས་ལ་མཚོན་ཤག་ཏི་བརྒྱས་བཏབ་ཀྱང་མི་འཆིའོ། །
en: Inside there, though a hundred spears strike them, they will not die.

source: ལུས་ལ་མཚོན་ཤག་ཏི་བརྒྱ་པ་གཉིས་པས་བཏབ་ཀྱང་མི་འཆིའོ། །
en: Though a hundred spears strike them a second time, they will not die.

source: ལུས་ལ་མཚོན་ཤག་ཏི་བརྒྱ་པ་གསུམ་པས་བཏབ་ཀྱང་མི་འཆིའོ། །
en: Though a hundred spears strike them a third time, they still will not die.

source: གང་གི་ཚེ་འཆི་བའི་དུས་མི་བྱེད་པ་དེའི་ཚེ་མེའི་འོབས་སུ་འཇུག་སྟེ།
en: Because they will not die, they are thrown into a furnace,

source: འོན་ཀྱང་འཆི་བའི་དུས་མི་བྱེད་པ་དང་།
en: but there they still will not die.

source: དེ་དག་ཁ་ཕྱི་ནས་ལྕགས་ཀྱི་ཐུ་ལུམ་བསྲེགས་པ་འཇུག་སྟེ།
en: “ ‘A red hot metal ball will be inserted into their mouths,

source: མཆུ་ཡང་ཚིག་སོ་ཡང་ལྷགས།
en: incinerating their lips, destroying their teeth,

source: རྐན་ཡང་གས།
en: splitting their palate,

source: གྲེ་བ་དང་། ལྐོག་མ་དང་། སྙིང་དང་། གཞང་དག་ཀྱང་སྒྲ་འུར་འུར་ཟེར་ཞིང་ལུས་ཐམས་ཅད་ཀྱང་ཚིག་པར་འགྱུར་རོ། །
en: and loudly burning up their throat, gullet, heart, anus, and whole body.

source: དེ་ལྟ་བས་ན་རྒྱལ་པོ་ཆེན་པོ་འཇིག་རྟེན་གཞན་ན་སྐྱབས་བྱེད་པ་སུ་ཡང་མེད་ཀྱིས་
en: “ ‘It is like this, great king. There will be no one to protect them in that other world.

source: རྒྱལ་པོ་ཆེན་པོ་ད་ནན་ཏན་དུ་བསོད་ནམས་གྱིས་ཤིག་
en: great king, you must diligently create merit in this life.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་དེ་ལ་རྒྱལ་པོ་ཆེན་པོ་དེ་རིང་ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་འདིར་ཕལ་ཆེར་འདུ་བར་འགྱུར་གྱིས་ང་ནི་འགྲོའོ་ཞེས་དེ་སྐད་སྨྲས་སོ། །
en: Bodhisattva Mahāsattva Avalokiteśvara then told that great king, ‘I must leave, for today many are gathering in the Jetavana Monastery.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་འོད་ཟེར་ཁ་དོག་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་རྣམ་པ་དུ་མ་བཏང་བ་དང་། དེ་དག་སོང་སྟེ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐྱོབ་པའི་སྤྱན་སྔར་འདུག་གོ། །
en: “Bodhisattva Mahāsattva Avalokiteśvara now radiated many blue, yellow, red, white, crystal, and silver light rays that reached Tathāgata Viśvabhū,

source: དེའི་ཚེ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དག་ཀྱང་འདུས་སོ། །
en: before whom devas, nāgas, yakṣas, mahoragas, and humans had gathered.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་ནང་ནས། ནམ་མཁའ་མཛོད་ཅེས་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སྟན་ལས་ལངས་ཏེ། །
en: “From within that assembly of bodhisattvas the bodhisattva named Gaganagañja arose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: bared one shoulder, and kneeling on his right knee and facing Bhagavat Viśvabhū, placed his palms together and addressed these words to him:

source: བཅོམ་ལྡན་འདས་འོད་ཟེར་འདི་དག་ག་ལས་མཆིས།
en: ‘Bhagavat, where did these light rays come from?’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་འདི་ལྷ་མ་ཡིན་གྱི་དབང་པོ་གཏོར་མའི་ཁང་པ་ན་གནས་ཏེ་དེ་ལ་འོད་ཟེར་འདི་དག་བྱུང་ངོ་། །
en: ‘Noble son, the light rays came from Bodhisattva Mahāsattva Avalokiteśvara, who is in the palace of Bali, the lord of the asuras.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའ་མཛོད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “Bodhisattva Gaganagañja then asked Bhagavat Viśvabhū,

source: བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་བལྟ་བའི་ཐབས་གང་ཞིག་མཆིས། །
en: ‘Is there a way for me to see Bodhisattva Mahāsattva Avalokiteśvara?’

source: རིགས་ཀྱི་བུ་དེ་ནི་འདི་ཉིད་དུ་འོང་ངོ་། །
en: ‘Noble son, he is coming here.’

source: གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལྷ་མ་ཡིན་གཏོར་མའི་གནས་ནས་བྱུང་བ་དེའི་ཚེ་
en: “When Bodhisattva Mahāsattva Avalokiteśvara left the palace of Bali, lord of the asuras,

source: ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དུ་ལྷའི་མེ་ཏོག་དག་ལྷགས་སོ། །
en: divine flowers fell on Jetavana Monastery,

source: ལྷའི་ཤིང་དཔག་བསམ་ཤིན་ཏུ་མཛེས་པ་རྒྱན་བརྒྱ་སྟོང་དུ་མ་དཔྱངས་པ། །
en: and extremely beautiful wish-granting trees appeared there. They were hung with hundreds of thousands of adornments,

source: མུ་ཏིག་གི་སེ་མོ་དོ་བརྒྱ་སྟོང་དུ་མ་དཔྱངས་པ།
en: with many hundreds of thousands of strings of pearls,

source: ཡུལ་ཀ་ཤི་ཀའི་གོས་དང་། རྒྱའི་གོས་དང་ཕྲེང་བའི་ཆུན་པོ་རབ་ཏུ་དཔྱངས་པ། །
en: with silk, with monastic robes, and with clusters of garlands.

source: སྡོང་པོ་ནི་དམར་པོ། ལོ་མ་ནི་གསེར་དང་དངུལ་ལས་བྱས་པ་དག་དང་།
en: Their trunks were red, and their leaves were made of gold and silver.

source: བྱི་རུའི་ཤིང་དུ་མ་དག་དང་། མེ་ཏོག་གི་ཤིང་དུ་མ་དག་དང་།
en: There were also many trees made of coral, many blossom-covered trees,

source: རྫིང་བུ་མེ་ཏོག་གིས་ཡོངས་སུ་གང་བ་བརྒྱ་ཕྲག་དུ་མ་དག་བྱུང་བར་གྱུར་ཏོ།
en: and pools that were completely filled with flowers.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མི་མཆིའམ།
en: ‘Bhagavat, is Bodhisattva Mahāsattva Avalokiteśvara not coming?’

source: རིགས་ཀྱི་བུ་དེ་ནི་ལྷ་མ་ཡིན་གྱི་དབང་པོ་གཏོར་མའི་ཁང་པ་ནས་བྱུང་སྟེ། མི་མི་རྒྱུ་བའི་ས་ཕྱོགས་མུན་པ་མུན་ནག་ཅེས་བྱ་བའི་སར་འགྲོ་སྟེ། །
en: ‘Noble son, he has left the palace of Bali, lord of the asuras, and is going to an extremely dreadful land named Tamondhakāra where there are no humans.

source: རིགས་ཀྱི་བུ་དེ་ན་ཉི་མ་དང་ཟླ་བ་མི་སྣང་སྟེ།
en: There, noble son, the sun and moon do not shine.

source: ནོར་བུ་ཡིད་བཞིན་རིན་པོ་ཆེ་དམ་པ་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་སྣང་བར་བྱེད་དོ། །
en: A wish-fulfilling jewel named Varada provides light in that place.

source: གླིང་དེ་ན་གནོད་སྦྱིན་དང་། སྲིན་པོ་བརྒྱ་སྟོང་དུ་མ་དག་གནས་སོ།
en: “Many hundreds of thousands of yakṣas and rākṣasas live in that continent.

source: གང་གི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་སོང་བ་དེའི་ཚེ་དེ་དག་དགའ་མགུ་ཞིང་སྙིང་རབ་ཏུ་དགའ་བར་གྱུར་ནས་
en: They become happy as Bodhisattva Mahāsattva Avalokiteśvara arrives there, and with joy in their hearts

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་མདུན་དུ་རྒྱུག་གོ། །བརྒྱུགས་ནས་ཀྱང་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ།
en: they run to him. When they come to Bodhisattva Mahāsattva Avalokiteśvara, they pay homage at his feet and ask,

source: ཁྱོད་ནི་མཉེལ་ཏོ། །དུབ་བོ། །
en: ‘You are not tired? You are not exhausted?

source: ཁྱོད་ནི་ཡུན་རིང་པོ་ཞིག་ནས་མུན་པ་མུན་ནག་གིས་འདིར་གཤེགས་སོ། །
en: It has been a long time since you were here in Tamondhakāra.’

source: ཞེས་དེ་སྐད་སྨྲའོ།
en: “He answers,

source: གནོད་སྦྱིན་དང་སྲིན་པོ་དེ་དག་གིས་དེ་ཁྲིད་ནས་ལྷའི་གསེར་དང་། རིན་པོ་ཆེའི་སེང་གེའི་ཁྲི་ལ་བཞག་སྟེ། །
en: “The yakṣas and rākṣasas lead him to a lion throne of divine gold and jewels, upon which he sits.

source: ངལ་བསོས་ནས་གནོད་སྦྱིན་དང་། སྲིན་པོ་དེ་དག་ལ་ཆོས་འཆད་པ་ཁྱེད་ཅག་ཉོན་ཅིག །
en: Seated, he teaches the Dharma to the yakṣas and rākṣasas: “ ‘Listen!

source: གང་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་འཕགས་པ་ཟ་མ་ཏོག་བཀོད་པ་འདིའི་རྩ་བ་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་ཉན་པ་དང་། འཛིན་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དེ་དག་ནི་
en: Those who hear and then possess, study, promulgate, and have their minds completely focused on even one four-line verse of the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་ལ་སྐུལ་བར་འགྱུར་རོ། །
en: will be inspired to accumulate merit.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡུལ་ཕྲ་རབ་ཀྱི་ཚད་ནི་ངས་གཟུང་ནུས་ཀྱི། །
en: “ ‘Noble sons, it is like this: For example, I know the number of atoms that exist, but,

source: རིགས་ཀྱི་བུ་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་ངས་བགྲང་མི་ནུས་སོ། །
en: noble sons, I cannot calculate the accumulation of merit that comes from the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display.

source: དཔེར་ན་རྒྱ་མཚོ་མཆིང་རྣམ་ཆེན་པོ་ནི་ངས་ཐིགས་པ་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི།
en: For example, I can count the drops in the vast ocean, but,

source: རིགས་ཀྱི་བུ་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པའི་རྩ་བ་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་ངས་བགྲང་མི་ནུས་ཏེ། །
en: noble sons, I cannot calculate the accumulation of merit that comes from even one four-line verse of the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display

source: དཔེར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་ཕྲག་བརྒྱ་བཅུ་གཉིས་སྙེད་གནས་གཅིག་ཏུ་
en: if tathāgatas, arhats, and samyaksaṃbuddhas as numerous as the grains of sand in twelve Ganges Rivers were gathered together in one place and

source: བསྐལ་པ་བཅུ་གཉིས་སུ་ན་བཟའ་དང་། བཤོས་དང་མལ་སྟན་དང་། ན་བའི་རྐྱེན་གྱི་སྨན་དང་། ཡོ་བྱད་ཀྱིས་བཀུར་སྟི་བྱས་པ་དེ་དག་གིས་ཀྱང་དེ་ལྟར་མི་ནུས་ན་ང་གཅིག་པུ་མུན་པ་མུན་ནག་གི་ནང་དུ་འདུག་པས་ལྟ་ཅི་སྨོས་སོ།
en: for twelve eons were provided with robes, food, bowls, bedding, seats, necessary medicine, and utensils, they would still not be able to calculate the merit that comes from even one four-line verse of the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display . So it is needless to say that I cannot do so all by myself in Tamondhakāra.

source: དཔེར་ན་གླིང་ཆེན་པོ་བཞིར་ཁྱིམ་རེ་རེ་ཞིང་ཡང་ལྷའི་གསེར་དང་རིན་པོ་ཆེའི་གཙུག་ལག་ཁང་བརྩིགས་ལ། གཙུག་ལག་ཁང་དེར་མཆོད་རྟེན་སྟོང་བྱས་ལ་ཉིན་གཅིག་བཞིན་དུ་དེ་དག་གི་ནང་དུ་རིང་བསྲེལ་བཅུག་ན།
en: For example, even if all the households in the four continents built monasteries of gold and jewels and built a thousand stūpas inside each of those monasteries, and in one day inserted relics in them all,

source: གང་དེ་དག་ཏུ་རིང་བསྲེལ་བཅུག་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་བས་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པ་འདིའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཤིན་ཏུ་མང་བར་འགྱུར་རོ།
en: the accumulation of merit from one four-line verse of the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display , would be far greater than the merit from inserting the relics.

source: དཔེར་ན་ཆུ་བོ་ཆེན་པོ་ལྔ་རྒྱ་མཚོ་མཆིང་རྣམ་ཆེན་པོར་འབབ་པ་དེ་བཞིན་དུ། །
en: For example, just as the five great rivers flow into the great ocean,

source: རིགས་ཀྱི་བུ་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཡང་དེ་དང་འདྲ་བར་འགྱུར་རོ། །
en: noble sons, in that same way merit accumulates from one four-line verse of the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་གནོད་སྦྱིན་དང་། སྲིན་པོ་དེ་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “Then the yakṣas and rākṣasas asked Bodhisattva Mahāsattva Avalokiteśvara,

source: སེམས་ཅན་གང་དག་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པ་འདི་འདྲ་བ་དེ་དག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཇི་ལྟ་བུ་ལགས། །
en: ‘What kind of accumulation of merit is obtained by those beings who write out this precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display

source: རིགས་ཀྱི་བུ་དེ་དག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་དཔག་ཏུ་མེད་པར་འགྱུར་རོ། །
en: “ ‘Noble sons, their accumulation of merit is immeasurable.

source: གང་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པ་འདྲིར་འཇུག་པ་དེ་དག་ནི་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་འདྲིར་འཇུག་པར་འགྱུར་རོ།
en: Those who engage in writing out the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display , are engaged in writing the eighty-four thousand compilations of the Dharma.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གླིང་བཞི་ལ་དབང་བ། བུ་དཔའ་བ། མཐུ་ཆེ་བ། གཟུགས་ཀྱི་ཡན་ལག་མཆོག་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་འཇོམས་པར་བྱེད་པ་སྟོང་དང་ལྡན་པར་འགྱུར་རོ།
en: They will become kings; they will become cakravartins who rule the four continents; they will give birth to thousands of brave heroic sons with perfect bodies and who defeat their adversaries.

source: གང་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པ་རྟག་ཏུ་འཛིན་ཅིང་མིང་གི་རྗེས་སུ་དྲན་པར་བྱེད་པ་དེ་དག་ནི་
en: “ ‘Those who always possess and remember the name of the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display

source: སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་རོ། །
en: will be completely liberated from the suffering of saṃsāra and be completely liberated from birth, aging, sickness, death, misery, lamentation, suffering, unhappiness, and conflict.

source: གང་ལ་ལར་སྐྱེ་བ་དེ་དང་དེ་དག་ཏུ་ཚེ་རབས་དྲན་པར་འགྱུར་རོ། །
en: Wherever they are reborn, in every life they will remember their previous lives.

source: དེ་དག་གི་ལུས་ལ་བ་ལང་གི་སྤོས་ཀྱི་ཙན་དན་སྣོམ་པར་འགྱུར་རོ། །
en: Their bodies will have an aroma like gośīrṣa sandalwood.

source: ཁ་ནས་མེ་ཏོག་ཨུད་པ་ལ་སྔོན་པོའི་དྲི་འབྱུང་བར་འགྱུར་རོ། །
en: From their mouths will come the scent of the blue lotus.

source: ལུས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Their bodies will be completely perfect,

source: སྟོབས་པོ་ཆེའི་སྟོབས་ཀྱི་ཤུགས་དང་ལྡན་པར་འགྱུར་རོ་
en: and they will have immense, powerful strength.’

source: གནོད་སྦྱིན་དང་། སྲིན་པོ་དེ་དག་ལས་ཁ་ཅིག་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ལ།
en: Some of the yakṣas and rākṣasas attained the result of becoming a once-returner.

source: ཁ་ཅིག་ནི་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་བཀོད་ནས། །
en: The others attained the result of becoming a non-returner.

source: གནས་གཞན་གང་དུ་ཡང་མ་བཞུད་ཅིག །
en: Do not go anywhere else.

source: མུན་པ་མུན་ནག་གི་ས་འདི་ཉིད་དུ་བདག་ཅག་གིས་ལྷའི་གསེར་གྱི་མཆོད་རྟེན་བགྱིའོ། །
en: We will build a stūpa of divine gold in Tamondhakāra.

source: ལྷའི་གསེར་གྱི་འཆག་ས་བགྱིའོ། །
en: We will create a circumambulatory walkway of gold.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “But Bodhisattva Mahāsattva Avalokiteśvara said to them,

source: ངས་སེམས་ཅན་དུ་མ་དག་བྱང་ཆུབ་ཀྱི་ལམ་ལ་དགོད་དགོས་སོ། །
en: ‘I have to bring many beings onto the path to enlightenment.’

source: དེ་ནས་གནོད་སྦྱིན་དང་སྲིན་པོ་དེ་དག་ལག་པ་ལ་འགྲམ་པ་བརྟེན་ཏེ་སེམས་ཤིང་འཁོད་ནས་གཅིག་ལ་གཅིག་འདི་སྐད་སྨྲའོ། །
en: “The yakṣas and rākṣasas, resting cheeks on hands, brooded and said to each other,

source: བདག་ཅག་གི་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་གཤེགས་པར་འགྱུར་བས་ཆོས་ཀྱི་གཏམ་སྤོང་བར་འགྱུར་རོ། །
en: ‘Our Avalokiteśvara is going to leave us, and we will not be able to talk about the Dharma with him.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་སོང་བ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དེ་དག་ཀྱང་ཕྱི་བཞིན་དུ་འབྲང་ནས་
en: “As Bodhisattva Mahāsattva Avalokiteśvara was leaving, the yakṣas and rākṣasas followed him.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱེད་ཤིན་ཏུ་རིང་དུ་འོངས་ཀྱིས་སླར་ལོག་ཤིག །
en: “Bodhisattva Mahāsattva Avalokiteśvara said to them, ‘It is too far for you to come, so you should go back.’

source: དེ་ནས་གནོད་སྦྱིན་དང་སྲིན་པོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་དེ་ཉིད་ནས་སླར་ལོག་གོ། །
en: “The yakṣas and rākṣasas bowed down at the feet of Bodhisattva Mahāsattva Avalokiteśvara and returned.

source: དེ་ནས་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མེའི་ཕུང་པོ་འབར་བ་བཞིན་དུ་ནམ་མཁའ་ལ་མི་སྣང་བར་གྱུར་ཏོ། །
en: “Then Avalokiteśvara vanished into the sky as a mass of flames.”

source: དེ་ནས་བྲམ་ཟེའི་གཟུགས་སུ་སྤྲུལ་ཏེ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དག་གི་དྲུང་དུ་སོང་སྟེ་ཕྱིན་ནས།
en: “Avalokiteśvara then manifested in the form of a brahmin and went among the devas in the Śuddhāvāsa realms.

source: ལྷའི་རིས་དེ་ན་ལྷའི་བུ་རྣ་ཆའི་མཆོག་ཅེས་བྱ་བ་དབུལ་པོ་སྡུག་བསྔལ་བ་ཞིག་འདུག་གོ། །
en: Among those devas there was a deva named Sukuṇḍala who was poor and suffering.

source: དེ་ནས་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་བྲམ་ཟེ་དེའི་གཟུགས་ཀྱིས་ལྷའི་བུ་དེའི་དྲུང་དུ་སོང་སྟེ། ཕྱིན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “Avalokiteśvara came to that deva in the form of the brahmin and said to him,

source: བདག་ནི་བཀྲེས་སོ། །སྐོམ་མོ། །
en: ‘I’m hungry and thirsty.’

source: དེ་ནས་ལྷའི་བུ་དེས་བྲམ་ཟེ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “The deva said to the brahmin,

source: བྲམ་ཟེ་ཆེན་པོ་བདག་ལ་ནི་ཅུང་ཟད་ཀྱང་མ་མཆིས་སོ།
en: ‘Great brahmin, I have nothing at all.’

source: བདག་ལ་ཆུང་ཟད་ཅིག་ནི་ངེས་པར་སྩལ་འཚལ་ལོ།
en: ‘You should give me what little you have.’

source: དེ་ནས་ལྷའི་བུ་གཞལ་མེད་ཁང་དུ་སོང་སྟེ་སྣོད་དག་བལྟས་པ་དང་། །
en: “So Sukuṇḍala entered his divine palace and looked inside his pots.

source: སྣོད་རྣམས་ལྷའི་ནོར་བུ་རིན་པོ་ཆེ་རིན་ཐང་མེད་པས་ཡོངས་སུ་གང་བ་དང་།
en: He saw that some pots had become completely filled with priceless precious jewels,

source: སྣོད་གཞན་དག་ཀྱང་རོའི་རོ་མཆོག་གི་ཟས་དག་གིས་ཡོངས་སུ་གང་བ་དང་།
en: other pots had become completely filled with food that had the supreme flavors,

source: གཡོན་ཕྱོགས་ཀྱི་གཞལ་མེད་ཁང་ན་ཡང་གོས་དང་རྒྱན་གྱིས་ཡོངས་སུ་གང་བ་མཐོང་ངོ་། །
en: and the left side of the divine palace had become completely filled with divine clothing.

source: དེ་ནས་ལྷའི་བུ་དེ་སེམས་པར་གྱུར་ནས་འདི་འདྲ་བའི་དཔལ་ཐོབ་པ་ལས་ན་བདག་གི་སྒོ་ན་ངེས་པར་སྣོད་བཟང་པོ་ཞིག་འདུག་གོ་སྙམ་མོ། །
en: “Sukuṇḍala thought, ‘Without a doubt the one at my door is an excellent recipient for offerings, and he has brought me this attainment of splendor.’

source: དེ་ནས་དེས་བྲམ་ཟེ་དེ་བོས་ཏེ་གཞལ་མེད་ཁང་གི་ནང་དུ་སོང་ནས་
en: “Sukuṇḍala invited the brahmin into his divine palace. The brahmin entered, and

source: ལྷའི་རིན་པོ་ཆེས་ཀྱང་བསྟབས།
en: Sukuṇḍala offered him the divine jewels,

source: ལྷའི་རོའི་རོ་མཆོག་གི་ཟས་ཀྱང་བྱིན་ཏེ་
en: served him the food with divine perfect flavors, and

source: ཟོས་ནས་བཀྲ་ཤིས་པ་བྱས་སོ། །
en: The brahmin ate and recited a benediction.
